benchmark/go-frameworks/results/20260924-101653/results/get/stdlib/r1/5000.txt
Running 40s test @ http://10.128.0.2:8081/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.911ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.907ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.175ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.160ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.908ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.910ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.913ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.906ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.917ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.176ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.919ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.934ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.082ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.926ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.927ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.929ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.93ms  405.99us   4.62ms   67.93%
    Req/Sec   330.21    477.85     3.56k    96.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.92ms
 75.000%    1.17ms
 90.000%    1.46ms
 99.000%    1.96ms
 99.900%    2.55ms
 99.990%    3.74ms
 99.999%    4.53ms
100.000%    4.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.124     0.000000            1         1.00
       0.396     0.100000        14979         1.11
       0.554     0.200000        29864         1.25
       0.690     0.300000        44785         1.43
       0.810     0.400000        59711         1.67
       0.917     0.500000        74611         2.00
       0.969     0.550000        82144         2.22
       1.021     0.600000        89614         2.50
       1.071     0.650000        97090         2.86
       1.121     0.700000       104466         3.33
       1.174     0.750000       111994         4.00
       1.201     0.775000       115663         4.44
       1.231     0.800000       119417         5.00
       1.270     0.825000       123086         5.71
       1.321     0.850000       126850         6.67
       1.382     0.875000       130581         8.00
       1.417     0.887500       132429         8.89
       1.455     0.900000       134280        10.00
       1.497     0.912500       136133        11.43
       1.543     0.925000       137999        13.33
       1.592     0.937500       139873        16.00
       1.620     0.943750       140801        17.78
       1.652     0.950000       141732        20.00
       1.685     0.956250       142669        22.86
       1.719     0.962500       143601        26.67
       1.756     0.968750       144516        32.00
       1.778     0.971875       144975        35.56
       1.803     0.975000       145443        40.00
       1.829     0.978125       145926        45.71
       1.855     0.981250       146383        53.33
       1.886     0.984375       146844        64.00
       1.903     0.985938       147081        71.11
       1.922     0.987500       147316        80.00
       1.943     0.989062       147542        91.43
       1.969     0.990625       147774       106.67
       1.997     0.992188       148008       128.00
       2.014     0.992969       148125       142.22
       2.028     0.993750       148241       160.00
       2.046     0.994531       148356       182.86
       2.069     0.995313       148475       213.33
       2.095     0.996094       148588       256.00
       2.111     0.996484       148649       284.44
       2.129     0.996875       148704       320.00
       2.155     0.997266       148766       365.71
       2.183     0.997656       148821       426.67
       2.243     0.998047       148879       512.00
       2.289     0.998242       148909       568.89
       2.347     0.998437       148937       640.00
       2.375     0.998633       148967       731.43
       2.455     0.998828       148996       853.33
       2.569     0.999023       149025      1024.00
       2.613     0.999121       149039      1137.78
       2.671     0.999219       149054      1280.00
       2.725     0.999316       149069      1462.86
       2.819     0.999414       149083      1706.67
       2.953     0.999512       149098      2048.00
       2.993     0.999561       149105      2275.56
       3.095     0.999609       149113      2560.00
       3.171     0.999658       149120      2925.71
       3.229     0.999707       149127      3413.33
       3.375     0.999756       149134      4096.00
       3.391     0.999780       149138      4551.11
       3.423     0.999805       149141      5120.00
       3.501     0.999829       149145      5851.43
       3.571     0.999854       149149      6826.67
       3.603     0.999878       149152      8192.00
       3.725     0.999890       149154      9102.22
       3.767     0.999902       149156     10240.00
       3.859     0.999915       149158     11702.86
       3.995     0.999927       149160     13653.33
       4.267     0.999939       149161     16384.00
       4.295     0.999945       149162     18204.44
       4.359     0.999951       149163     20480.00
       4.375     0.999957       149164     23405.71
       4.387     0.999963       149165     27306.67
       4.427     0.999969       149166     32768.00
       4.427     0.999973       149166     36408.89
       4.483     0.999976       149167     40960.00
       4.483     0.999979       149167     46811.43
       4.507     0.999982       149168     54613.33
       4.507     0.999985       149168     65536.00
       4.507     0.999986       149168     72817.78
       4.531     0.999988       149169     81920.00
       4.531     0.999989       149169     93622.86
       4.531     0.999991       149169    109226.67
       4.531     0.999992       149169    131072.00
       4.531     0.999993       149169    145635.56
       4.619     0.999994       149170    163840.00
       4.619     1.000000       149170          inf
#[Mean    =        0.925, StdDeviation   =        0.406]
#[Max     =        4.616, Total count    =       149170]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  198702 requests in 40.01s, 72.01MB read
Requests/sec:   4965.73
Transfer/sec:      1.80MB